package utils

import (
	"fmt"
)

func PrintInfo() {
	fmt.Println("" +
		"   /$$$$$$        /$$$$$$        /$$$$$$ \n" +
		"  /$$__  $$      |_  $$_/       /$$__  $$\n" +
		" | $$  \\__/        | $$        | $$  \\__/\n" +
		" |  $$$$$$         | $$        | $$      \n" +
		"  \\____  $$        | $$        | $$      \n" +
		"  /$$  \\ $$        | $$        | $$    $$\n" +
		" |  $$$$$$/       /$$$$$$      |  $$$$$$/\n" +
		"  \\______/       |______/       \\______/")
	fmt.Println("程序原创：黄浩泓、刘梦云、马世龙（1.0版本）\n程序重构：许文彬（2.0版本）")
	fmt.Println("温馨提示：直播期间请勿关闭黑窗口！！！")
	fmt.Println("当前版本：\x1b[32mv2.3.0\x1b[0m")
}
